# DataFrame

## What is DataFrame?

In [1]:
import pandas as pd

In [2]:
data={"name":["Bill","Tom","Tim","John","Alex","Vanessa","Kate"],      
      "score":[90,80,85,75,95,60,65],      
      "sport":["Wrestling","Football","Skiing","Swimming","Tennis",
               "Karete","Surfing"],      
      "sex":["M","M","M","M","F","F","F"]}

In [3]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [4]:
df=pd.DataFrame(data)

In [5]:
df

      name  score      sport sex
0     Bill     90  Wrestling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karete   F
6     Kate     65    Surfing   F

In [6]:
df.tail(3)

      name  score    sport sex
4     Alex     95   Tennis   F
5  Vanessa     60   Karete   F
6     Kate     65  Surfing   F

In [7]:
df.columns

Index(['name', 'score', 'sport', 'sex'], dtype='object')

In [8]:
df.shape

(7, 4)

In [17]:
df.dtypes

name     object
score     int64
sport    object
sex      object
dtype: object

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   score   7 non-null      int64
 2   sport   7 non-null      object
 3   sex     7 non-null      object
dtypes: int64(1), object(3)
memory usage: 356.0+ bytes

In [20]:
df.isnull().sum()

name     0
score    0
sport    0
sex      0
dtype: int64

In [23]:
# adding a new column
values=[18,19,20,18,17,17,18]
df['Age'] = values

In [24]:
df

      name  score      sport sex  Age
0     Bill     90  Wrestling   M   18
1      Tom     80   Football   M   19
2      Tim     85     Skiing   M   20
3     John     75   Swimming   M   18
4     Alex     95     Tennis   F   17
5  Vanessa     60     Karete   F   17
6     Kate     65    Surfing   F   18

In [26]:
df.iloc[1:4]

   name  score     sport sex
1   Tom     80  Football   M
2   Tim     85    Skiing   M
3  John     75  Swimming   M

In [31]:
df.loc[0:2,['name','score']]

   name  score
0  Bill     90
1   Tom     80
2   Tim     85

In [36]:
df.iloc[0:2,0:2]

   name  score
0  Bill     90
1   Tom     80

In [33]:
df[['name','score']]

      name  score
0     Bill     90
1      Tom     80
2      Tim     85
3     John     75
4     Alex     95
5  Vanessa     60
6     Kate     65

In [15]:
df1 = df[['name','score']]

In [17]:
df1.shape

(7, 2)

In [5]:
df=pd.DataFrame(data,columns=["name","sport","sex","score"])
df

      name      sport sex  score
0     Bill  Wrestling   M     90
1      Tom   Football   M     80
2      Tim     Skiing   M     85
3     John   Swimming   M     75
4     Alex     Tennis   F     95
5  Vanessa     Karete   F     60
6     Kate    Surfing   F     65

In [6]:
df.shape

(7, 4)

In [6]:
df.head()

   name      sport sex  score
0  Bill  Wrestling   M     90
1   Tom   Football   M     80
2   Tim     Skiing   M     85
3  John   Swimming   M     75
4  Alex     Tennis   F     95

In [7]:
df.tail()

      name     sport sex  score
2      Tim    Skiing   M     85
3     John  Swimming   M     75
4     Alex    Tennis   F     95
5  Vanessa    Karete   F     60
6     Kate   Surfing   F     65

In [8]:
df.tail(3)

      name    sport sex  score
4     Alex   Tennis   F     95
5  Vanessa   Karete   F     60
6     Kate  Surfing   F     65

In [9]:
df.head(2)

   name      sport sex  score
0  Bill  Wrestling   M     90
1   Tom   Football   M     80

In [40]:
df

      name  score      sport sex
0     Bill     90  Wrestling   M
1      Tom     80   Football   M
2      Tim     85     Skiing   M
3     John     75   Swimming   M
4     Alex     95     Tennis   F
5  Vanessa     60     Karete   F
6     Kate     65    Surfing   F

In [41]:
data

{'name': ['Bill', 'Tom', 'Tim', 'John', 'Alex', 'Vanessa', 'Kate'],
 'score': [90, 80, 85, 75, 95, 60, 65],
 'sport': ['Wrestling',
  'Football',
  'Skiing',
  'Swimming',
  'Tennis',
  'Karete',
  'Surfing'],
 'sex': ['M', 'M', 'M', 'M', 'F', 'F', 'F']}

In [10]:
df=pd.DataFrame(data,columns=["name", "sport", "gender", "score", "age"])
df

      name      sport gender  score  age
0     Bill  Wrestling    NaN     90  NaN
1      Tom   Football    NaN     80  NaN
2      Tim     Skiing    NaN     85  NaN
3     John   Swimming    NaN     75  NaN
4     Alex     Tennis    NaN     95  NaN
5  Vanessa     Karete    NaN     60  NaN
6     Kate    Surfing    NaN     65  NaN

In [42]:
df=pd.DataFrame(data,columns=["name", "sport", "gender", "score", "age"],
                index=["one","two","three","four","five","six","seven"])
df

          name      sport gender  score  age
one       Bill  Wrestling    NaN     90  NaN
two        Tom   Football    NaN     80  NaN
three      Tim     Skiing    NaN     85  NaN
four      John   Swimming    NaN     75  NaN
five      Alex     Tennis    NaN     95  NaN
six    Vanessa     Karete    NaN     60  NaN
seven     Kate    Surfing    NaN     65  NaN

In [29]:
df.loc['one':'four']

       name      sport gender  score  age
one    Bill  Wrestling    NaN     90  NaN
two     Tom   Football    NaN     80  NaN
three   Tim     Skiing    NaN     85  NaN
four   John   Swimming    NaN     75  NaN

In [12]:
df["sport"]

one      Wrestling
two       Football
three       Skiing
four      Swimming
five        Tennis
six         Karete
seven      Surfing
Name: sport, dtype: object

In [44]:
# my_columns=["name","sport"]
# df[my_columns]

In [45]:
df.loc[:,["name","sport"]]

          name      sport
one       Bill  Wrestling
two        Tom   Football
three      Tim     Skiing
four      John   Swimming
five      Alex     Tennis
six    Vanessa     Karete
seven     Kate    Surfing

In [18]:
df['sport']

0    Wrestling
1     Football
2       Skiing
3     Swimming
4       Tennis
5       Karete
6      Surfing
Name: sport, dtype: object

In [14]:
df.loc[["one"]]

     name      sport gender  score  age
one  Bill  Wrestling    NaN     90  NaN

In [ ]:
df.loc[["one":"two"]]

In [46]:
df["age"]=18

In [49]:
df=pd.DataFrame(data,columns=["name", "sport", "gender", "score", "age"], 
                index=["one","two","three","four","five","six","seven"])
values=[18,19,20,18,17,17,18]
df["age"]=values
#df["age"]=18
df

          name      sport gender  score  age
one       Bill  Wrestling    NaN     90   18
two        Tom   Football    NaN     80   19
three      Tim     Skiing    NaN     85   20
four      John   Swimming    NaN     75   18
five      Alex     Tennis    NaN     95   17
six    Vanessa     Karete    NaN     60   17
seven     Kate    Surfing    NaN     65   18

In [50]:
df["pass"]=df['score']>=70
df

          name      sport gender  score  age   pass
one       Bill  Wrestling    NaN     90   18   True
two        Tom   Football    NaN     80   19   True
three      Tim     Skiing    NaN     85   20   True
four      John   Swimming    NaN     75   18   True
five      Alex     Tennis    NaN     95   17   True
six    Vanessa     Karete    NaN     60   17  False
seven     Kate    Surfing    NaN     65   18  False

In [52]:
df.drop(columns=['pass'],inplace=True)

In [53]:
df

          name      sport gender  score  age
one       Bill  Wrestling    NaN     90   18
two        Tom   Football    NaN     80   19
three      Tim     Skiing    NaN     85   20
four      John   Swimming    NaN     75   18
five      Alex     Tennis    NaN     95   17
six    Vanessa     Karete    NaN     60   17
seven     Kate    Surfing    NaN     65   18

In [56]:
df = df.drop(columns = ['age'])

In [57]:
df

          name      sport gender  score
one       Bill  Wrestling    NaN     90
two        Tom   Football    NaN     80
three      Tim     Skiing    NaN     85
four      John   Swimming    NaN     75
five      Alex     Tennis    NaN     95
six    Vanessa     Karete    NaN     60
seven     Kate    Surfing    NaN     65

In [58]:
# del df["pass"]
# df

In [54]:
df.loc[df['name']=='Tom','sport'] = 'Tennis'

In [49]:
df.loc[df['name']=='Tom','sport'] = 'karate'

In [19]:
df.loc[df['name'] == 'Tom', 'sport'] = 'Karate'

In [55]:
df

      name  score      sport sex  Age
0     Bill     90  Wrestling   M   18
1      Tom     80     Tennis   M   19
2      Tim     85     Skiing   M   20
3     John     75   Swimming   M   18
4     Alex     95     Tennis   F   17
5  Vanessa     60     Karete   F   17
6     Kate     65    Surfing   F   18

In [20]:
df.shape

(7, 4)

In [57]:
df.drop('sex',axis = 1)

      name  score      sport  Age
0     Bill     90  Wrestling   18
1      Tom     80     Tennis   19
2      Tim     85     Skiing   20
3     John     75   Swimming   18
4     Alex     95     Tennis   17
5  Vanessa     60     Karete   17
6     Kate     65    Surfing   18

In [22]:
df.drop('sex',axis = 1)

      name  score      sport
0     Bill     90  Wrestling
1      Tom     80     Karate
2      Tim     85     Skiing
3     John     75   Swimming
4     Alex     95     Tennis
5  Vanessa     60     Karete
6     Kate     65    Surfing

In [59]:
df.drop(6)

      name  score      sport sex  Age
0     Bill     90  Wrestling   M   18
1      Tom     80     Tennis   M   19
2      Tim     85     Skiing   M   20
3     John     75   Swimming   M   18
4     Alex     95     Tennis   F   17
5  Vanessa     60     Karete   F   17

In [24]:
df.columns

Index(['name', 'score', 'sport', 'sex'], dtype='object')

In [25]:
df.dtypes

name     object
score     int64
sport    object
sex      object
dtype: object

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   score   7 non-null      int64
 2   sport   7 non-null      object
 3   sex     7 non-null      object
dtypes: int64(1), object(3)
memory usage: 356.0+ bytes

In [27]:
df.describe()

           score
count   7.000000
mean   78.571429
std    12.817399
min    60.000000
25%    70.000000
50%    80.000000
75%    87.500000
max    95.000000